[
    {
        "title": "Software Development Manager",
        "company_name": "Audible, Inc.",
        "location": "  Newark, NJ   ",
        "via": "via Newark, NJ - Geebo",
        "description": "Job summaryGood storytelling starts with great listening.\nAt Audible, that means each role and every project has our audience in mind.\nBecause the same people who design, develop, and deploy our products also happen to use them...\nTo us, that speaks volumes.\nABOUT THIS ROLEThe position requires an engineer with experience architecting, developing and supporting distributed & scalable systems and high-volume transaction applications and services with hands-on coding experience in modern object-oriented language.\nIn this role, you will exhibit leadership qualities including excellent judgment and high standards.\nYou will have the ability to dive deep and remain in touch with business details, drive innovation in the teams, invoke passion in others, think big, and deliver results.\nIf you are an experienced Software Development Manager with a creative edge, problem-solving skills, a software development foundation and desire and to be part of Audible's next generation technology, we want to talk with you.\nJoining our team provides the unique challenge and opportunity to deliver software that benefits many customers around the world.\nABOUT THE TEAMWe are a team responsible for the backend engineering of search and discovery experience for our customers worldwide.\nIn the background, we work closely with Data science to leverage advanced machine learning to match and rank relevant content to every customer's query.\nAs a Manager of Software Development, you will Own the complete software development lifecycle:\ndefining, prioritizing, designing, and leading implementation and testing of new features within an Agile environment.\nDefine, manage and improve the software and product development processes by working closely with high-performance engineers.\nManage the day-to-day activities of the engineering team and ensure project plans and delivery commitments are met.\nCoach and mentor our high-performing architects and engineers to help them grow their skills, enhance their knowledge of our systems and their ability to get things done, while enabling them to be future leaders who are focused on building a high growth and inclusive culture.\nArchitect and develop the innovative technical design and implementation approach with the overall product line goals and objectives in mind.\nOwn team's operational excellence, including creation of and monitoring of metrics and alarms in a continuous process improvement environment.\nManage department resources, staffing, mentoring, and enhancing to maintain a best-in-class engineering team.\nHold regular 1:\n1s with the team.\n.\nEstimated Salary: $20 to $28 per hour based on qualifications",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "ABOUT THIS ROLEThe position requires an engineer with experience architecting, developing and supporting distributed & scalable systems and high-volume transaction applications and services with hands-on coding experience in modern object-oriented language",
                    "If you are an experienced Software Development Manager with a creative edge, problem-solving skills, a software development foundation and desire and to be part of Audible's next generation technology, we want to talk with you"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "You will have the ability to dive deep and remain in touch with business details, drive innovation in the teams, invoke passion in others, think big, and deliver results",
                    "As a Manager of Software Development, you will Own the complete software development lifecycle:",
                    "defining, prioritizing, designing, and leading implementation and testing of new features within an Agile environment",
                    "Define, manage and improve the software and product development processes by working closely with high-performance engineers",
                    "Manage the day-to-day activities of the engineering team and ensure project plans and delivery commitments are met",
                    "Coach and mentor our high-performing architects and engineers to help them grow their skills, enhance their knowledge of our systems and their ability to get things done, while enabling them to be future leaders who are focused on building a high growth and inclusive culture",
                    "Architect and develop the innovative technical design and implementation approach with the overall product line goals and objectives in mind",
                    "Own team's operational excellence, including creation of and monitoring of metrics and alarms in a continuous process improvement environment",
                    "Manage department resources, staffing, mentoring, and enhancing to maintain a best-in-class engineering team"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Estimated Salary: $20 to $28 per hour based on qualifications"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.audible.com/",
                "text": "audible.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Audible,+Inc.&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCM8J",
                "text": "See web results for Audible, Inc."
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwPkAKi2zth_ZIqvf6lg0xnza-ZM2oTVOhtI4V&s=0",
        "extensions": [
            "2 days ago",
            "20–28 an hour",
            "Full-time",
            "No degree mentioned"
        ],
        "detected_extensions": {
            "posted_at": "2 days ago",
            "schedule_type": "Full-time",
            "salary": "20–28 an hour"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBNYW5hZ2VyIiwiaHRpZG9jaWQiOiJhbXVqU2pYXzdDNEFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVMXJNbXhzU1ZOc00zSkZRbVY0YUY5cVdISmFOV1I1VkhWVGVtcEhRMTlUU25GMVREUm5kVU5MUW5BdGRFdE1aRFZWY1hWWU4xUnNVSG8xTjA5UGNHWlJjVTVHUVdSVFl6VnBUSGs1Y1dSRU9ERXdTVWhYUVdSaFVsVkZja1ZpYUc1bGJGODBlSFJFUkhWa1JWWlBiMUZhV0dKd09ESkZNRmxmYldkU2VWQnJiMEpxV2s0NGJWWnpiMk5IZVZKU1dsTndWbmQzUVZwelMzQjBUbGRxTnpOZlJUZFROalZsV0dKVVZ6UjVXRXQ2VFZoQ1JtTlZORjlXYlVSNGRYQmhlWEZCVW5SeWNFWktTbU5YRWhkcVVFZGZXa3BNZDBKMkxXWnJVRWxRZVRoNWEzZEJNQm9pUVV4RlV6bDFVSE40YjJ0RFlVVnFVRXRTTFU1WFpFNXllVE5rVEdZdE4xaHNRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiLm5GZzJlYntmb250LXdlaWdodDo1MDB9LkJpNkRkY3tmb250LXdlaWdodDo1MDB9QXBwbHkgZGlyZWN0bHkgb24gTmV3YXJrLCBOSiAtIEdlZWJvIiwibGluayI6Imh0dHBzOi8vbmV3YXJrLW5qLmdlZWJvLmNvbS9qb2JzLW9ubGluZS92aWV3L2lkLzEwODQyNTYwNzktc29mdHdhcmUtZGV2ZWxvcG1lbnQtbWFuYWdlci0vP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Software Engineering Director at Synchron in Brooklyn, NY",
        "company_name": "Synchron",
        "location": "  Brooklyn, NY   ",
        "via": "via Brooklyn, NY - Geebo",
        "description": "As a leader in brain-to-machine communication, Synchron is poised to create a significant impact in its industry and to meaningfully impact many peoples' lives. Whilst the company's technology is maturing fast (4 clinical trial participants have already benefited from the first-generation device), there is an opportunity to help shape the company's direction and to work in a dynamic... multi-disciplinary and growing team. We are a lean, fast-paced, passionate team pushing the boundaries of what is possible in the neurotech space to dramatically improve the quality of life of millions of people globally, and we want you to join us. Director of Software Engineering The Director of Software Engineering is responsible for building a new software organization for Synchron as a leader in the brain computer interface. The software director will be responsible for development of a software process that includes pathways for regulated and unregulated software projects. This director will work cross functionally to translate user needs into software requirements and lead the team through the software development process. The software director is responsible for creating an extensible software architecture that lends itself to a product roadmap for ongoing innovation for the patient, caregiver, and business needs.\nResponsibilities:\nBuild and lead a high performing team of software engineers from project conception to commercialization. Develop a software process that includes pathways for regulated and unregulated software Develop software architecture in partnership with business partners to be extensible to future development needs Work with cross disciplinary teams to define requirements and processes and provide software builds on a cadence for creating system maturity on a cadence Work closely with regulatory partners to develop regulated software process, documentation, and support audits Partner with external software vendors to augment internal software team capabilities and build flex resourcing capabilities We are looking for a strategic thinker capable of translating business objectives into tactical action plans and milestones. We are looking for someone who is results-oriented and an effective collaborator and relationship builder. Minimum Qualifications Software development and commercialization experience People Management experience Preferred Qualifications Experience developing and commercializing software over a broad range of products/applications Personal drive, individual accountability & a strong bias for action Excellent organizational, communication, and collaboration skills\nSalary Range:\n$150K -- $200K\nMinimum Qualification\nSoftware DevelopmentEstimated Salary: $20 to $28 per hour based on qualifications",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Develop a software process that includes pathways for regulated and unregulated software Develop software architecture in partnership with business partners to be extensible to future development needs Work with cross disciplinary teams to define requirements and processes and provide software builds on a cadence for creating system maturity on a cadence Work closely with regulatory partners to develop regulated software process, documentation, and support audits Partner with external software vendors to augment internal software team capabilities and build flex resourcing capabilities We are looking for a strategic thinker capable of translating business objectives into tactical action plans and milestones",
                    "We are looking for someone who is results-oriented and an effective collaborator and relationship builder"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "The software director will be responsible for development of a software process that includes pathways for regulated and unregulated software projects",
                    "This director will work cross functionally to translate user needs into software requirements and lead the team through the software development process",
                    "The software director is responsible for creating an extensible software architecture that lends itself to a product roadmap for ongoing innovation for the patient, caregiver, and business needs",
                    "Build and lead a high performing team of software engineers from project conception to commercialization"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "$150K -- $200K",
                    "Software DevelopmentEstimated Salary: $20 to $28 per hour based on qualifications"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&q=Synchron&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCJMK",
                "text": "See web results for Synchron"
            }
        ],
        "extensions": [
            "16 hours ago",
            "20–28 an hour",
            "Full-time",
            "No degree mentioned"
        ],
        "detected_extensions": {
            "posted_at": "16 hours ago",
            "schedule_type": "Full-time",
            "salary": "20–28 an hour"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyBEaXJlY3RvciBhdCBTeW5jaHJvbiBpbiBCcm9va2x5biwgTlkiLCJodGlkb2NpZCI6IjZjN0FVeHBjcFQ4QUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVUxck1teHNTMFp1TkVSaFV6bDFWamhPTWxFM0xYa3paa054YkVKYVgySldOVWRJUTJkR1VXMUVSMnRxYzBwNVN6SnVVR0U0U2tOMWFUVnNUSHBMWDNGMmF6SlFhazlXVVMxM1JXVkRSMGQwV2xWQ09EUXdjRlY2ZVc1NFNrNUxUbXRNYzJoV1VuQlVWRVZHWDNCcGJTMDNUVkpVWW1FNFRWbEhVREptVEdOSVJIcG9kV1kzVkdrd1RGcHlWRmszYkZweldrVnpiVWxxVlRaQ01VNTVlbEp0YVZaMWMwd3lUVFYyVFRONmVHazBSR1UwVFhaVU1sbHJSMUZLVG1od1FtRmZXbVJLWkRGRlNVRnVhR1JFVVZwWlZsOHhVRXRXZW1oeFkwMWtkbUZHWnhJWGFsQkhYMXBLVEhkQ2RpMW1hMUJKVUhrNGVXdDNRVEFhSWtGTVJWTTVkVTFGUmpKd01FZEVkalJ6VTBWek1rWkhia2gxTFd0WVZtMVhkbmMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IGRpcmVjdGx5IG9uIEJyb29rbHluLCBOWSAtIEdlZWJvIiwibGluayI6Imh0dHBzOi8vYnJvb2tseW4tbnkuZ2VlYm8uY29tL2pvYnMtb25saW5lL3ZpZXcvaWQvMTA3ODkxODMzOS1zb2Z0d2FyZS1lbmdpbmVlcmluZy1kaXJlY3Rvci1hdC0vP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Founding Staff Software Engineer, New Products",
        "company_name": "Justworks",
        "location": "  New York, NY   ",
        "via": "via Tech:NYC Job Board",
        "description": "Who We Are\n\nAt Justworks, you’ll enjoy a welcoming and casual environment, great benefits, wellness program offerings, company retreats, and the ability to interact with and learn from leaders in the startup community. We work hard and care about our most prized asset - our people...\n\nWe’re helping businesses get off the ground by enabling them to focus on running their business. We solve HR issues. We’re data-driven and never stop iterating. If you’d like to work in a supportive, entrepreneurial environment, are interested in building something meaningful and having fun while doing it, we’d love to hear from you.\n\nWe're united by shared goals and shared motivations at Justworks. These are best summed up in our company values, which are reflected in our product and in our team.\n\nOur Values\n\nIf this sounds like you, you’ll fit right in.\n\nWho You Are\n\nAre you passionate about design and development? Do you have experience building, deploying, and maintaining large-scale, distributed applications? Are you ready to take your skills to the next level and join a team of innovative self-starters in a supportive, entrepreneurial environment?\n\nAs a Founding Staff Software Engineer on Justworks’ New Products team, you will have the opportunity to take a project team from “zero to one” by leveraging your aptitude for navigating ambiguity and your experience working within a service-oriented architecture. If you are someone who:\n• Has a founder’s mindset who enjoys building and scaling a team, setting standards, being a mentor\n• Thrives when tasked with a complex problem in a space where we don’t have all the answers\n• Places emphasis on a team finding the right answer ahead of any one person being the one who was right\n• Thinks in terms of outcomes rather than outputs\n• Avoids over-engineering solutions and appreciate how building software can be a means for learning, gaining insights, and ultimately solving problems that people actually have\n\nWe’d love to hear from you!\nYour Success Profile\nWhat You Will Work On\n• Collaborate with a tight-knit, cross-functional team to find solutions to customer challenges\n• Scope and lead complex projects or changes that will benefit the entire organization\n• Build flexible, test-driven software that minimizes tech debt and enables change\n• Support, monitor, and maintain integrations with industry leading third-party platforms\n• Shape API driven services that are secure, compliant, and highly auditable\n• Enable an experience that is fully internationalized and localized for a global customer base\n• Build features and functionality that our customers use directly, typically in an iterative fashion taking into account user feedback\n• Own the technical direction of an evergreen initiative operating as a start-up\n• Serve as a role model for and work towards improving engineering standards, tooling, and processes\n• Mentor engineers to help them grow their technical skills by fostering a culture of continuous learning and improvement\n• Perform other related duties as assigned\nHow You Will Do Your Work\n\nAs a Staff Software Engineer, how results are achieved is paramount for your success and ultimately result in our success as an organization. In this role, your foundational knowledge, skills, abilities and personal attributes are anchored in the following competencies:\n• Good judgment - the exercise of critical thinking, analyzing and assessing problems and implications, identifying patterns, making connections of underlying issues, understanding risks and developing mitigation strategies, and taking ownership of the outcome.\n• Resourcefulness - taking a can-do approach, even in the face of obstacles and constraints by assessing what’s in front of you and effectively and efficiently optimizing what you have, whether it's working on something new or thinking about how to do something better.\n• Teamwork and communication - putting our collective best together through documentation, collaboration, relationship-building, listening, empathy, recruiting, and evangelism.\n• Influence and leadership - fostering a community of knowledge-sharing, collaboration, mentorship, and forward-thinking.\n• Skills and knowledge - the capacity to actively learn and apply specific domain knowledge, know-how, and best practices to continually enhance and improve.\n\nIn addition, all Justworkers focus on aligning their behaviors to our core values known as COGIS. It stands for:\n• Camaraderie - Day to day you can be seen working together toward a higher purpose. You like to have fun. You’re an active listener, treat people respectfully, and have a strong desire to know and help others.\n• Openness - Your default is to be open. You're willing to share information, understand other perspectives, and consider new possibilities. You’re curious, ask open questions, and are receptive to thoughts and feedback from others.\n• Grit - You demonstrate grit by having the courage to commit and persevere. You’re committed, earnest, and dive in to get the job done well with a positive attitude.\n• Integrity - Simply put, do what you say and say what you'll do. You’re honest and forthright, have a strong moral compass, and strive to match your words with your actions while leading by example.\n• Simplicity - Be like Einstein: “Everything should be made as simple as possible, but no simpler.”\nQualifications\n• 8+ years of professional hands-on experience\n• Expertise in large-scale platform applications; we expect staff candidates to leverage a diverse skill set\n• Strong object-oriented design and coding skills with experience architecting solutions for complicated systems\n• Solid understanding of data structures and algorithms\n• Experience proactively collaborating across different engineering teams\n• Demonstrable experience leading engineers without formal direct reporting relationships\n• Experience in a high-growth environment working on early stage products, with deadlines and milestones\n• Comfortable with ambiguity; you enjoy figuring out what needs to be done\n• Payroll and payments experience is a strong plus\n\nTechnologies Used\n\nWe are building a highly available and globally distributed Ruby on Rails API with Kubernetes on AWS. The front-end is built on React with TypeScript and GraphQL. Observability, monitoring, and metrics are managed through DataDog and Rollbar. Internal tooling is built with Retool.\n\nThe base wage range for this position based in our New York City Office is targeted at $220,000.00 to $253,000.00 per year.\n\n#LI-AD1 #LI-Hybrid\n\nActual compensation is based on multiple factors that are unique to each candidate, including and not limited to skill set, level of relevant experience, and specific work location. Salary ranges for positions based in other locations may differ based on the cost of labor in that location.\n\nFor more information about Justworks’ Total Reward Philosophy, including all of the perks and benefits we are proud to offer our team members, please visit Total Rewards @ Justworks.\nDiversity At Justworks\n\nJustworks is committed to maintaining a workplace where diversity of identity, culture, and life experience is the norm and is celebrated authentically and respected consistently. Diversity in our work, our people, and our product drives creativity and innovation, entrepreneurial leadership and integrity, competitiveness, and collaboration throughout our business and in the market. We depend on our differences to make our team stronger, our workplace more dynamic, and our product accessible to all of our customers.\n\nWe’re proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or familial status, disability, pregnancy, gender identity or expression, veteran status, genetic information, or any other legally protected status.\n\nOur DEIB Report and Our DEI Commitment",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Do you have experience building, deploying, and maintaining large-scale, distributed applications?",
                    "Has a founder’s mindset who enjoys building and scaling a team, setting standards, being a mentor",
                    "Good judgment - the exercise of critical thinking, analyzing and assessing problems and implications, identifying patterns, making connections of underlying issues, understanding risks and developing mitigation strategies, and taking ownership of the outcome",
                    "Resourcefulness - taking a can-do approach, even in the face of obstacles and constraints by assessing what’s in front of you and effectively and efficiently optimizing what you have, whether it's working on something new or thinking about how to do something better",
                    "Teamwork and communication - putting our collective best together through documentation, collaboration, relationship-building, listening, empathy, recruiting, and evangelism",
                    "Skills and knowledge - the capacity to actively learn and apply specific domain knowledge, know-how, and best practices to continually enhance and improve",
                    "You’re an active listener, treat people respectfully, and have a strong desire to know and help others",
                    "Openness - Your default is to be open",
                    "You're willing to share information, understand other perspectives, and consider new possibilities",
                    "You’re curious, ask open questions, and are receptive to thoughts and feedback from others",
                    "Grit - You demonstrate grit by having the courage to commit and persevere",
                    "You’re committed, earnest, and dive in to get the job done well with a positive attitude",
                    "Integrity - Simply put, do what you say and say what you'll do",
                    "You’re honest and forthright, have a strong moral compass, and strive to match your words with your actions while leading by example",
                    "Simplicity - Be like Einstein: “Everything should be made as simple as possible, but no simpler.”",
                    "8+ years of professional hands-on experience",
                    "Expertise in large-scale platform applications; we expect staff candidates to leverage a diverse skill set",
                    "Strong object-oriented design and coding skills with experience architecting solutions for complicated systems",
                    "Solid understanding of data structures and algorithms",
                    "Experience proactively collaborating across different engineering teams",
                    "Demonstrable experience leading engineers without formal direct reporting relationships",
                    "Experience in a high-growth environment working on early stage products, with deadlines and milestones",
                    "Comfortable with ambiguity; you enjoy figuring out what needs to be done",
                    "Payroll and payments experience is a strong plus"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Places emphasis on a team finding the right answer ahead of any one person being the one who was right",
                    "Thinks in terms of outcomes rather than outputs",
                    "Collaborate with a tight-knit, cross-functional team to find solutions to customer challenges",
                    "Scope and lead complex projects or changes that will benefit the entire organization",
                    "Build flexible, test-driven software that minimizes tech debt and enables change",
                    "Support, monitor, and maintain integrations with industry leading third-party platforms",
                    "Shape API driven services that are secure, compliant, and highly auditable",
                    "Enable an experience that is fully internationalized and localized for a global customer base",
                    "Build features and functionality that our customers use directly, typically in an iterative fashion taking into account user feedback",
                    "Own the technical direction of an evergreen initiative operating as a start-up",
                    "Serve as a role model for and work towards improving engineering standards, tooling, and processes",
                    "Mentor engineers to help them grow their technical skills by fostering a culture of continuous learning and improvement",
                    "Perform other related duties as assigned",
                    "Influence and leadership - fostering a community of knowledge-sharing, collaboration, mentorship, and forward-thinking"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "The base wage range for this position based in our New York City Office is targeted at $220,000.00 to $253,000.00 per year"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.justworks.com/",
                "text": "justworks.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Justworks&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCNoK",
                "text": "See web results for Justworks"
            }
        ],
        "extensions": [
            "Full-time",
            "No degree mentioned"
        ],
        "detected_extensions": {
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJGb3VuZGluZyBTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciwgTmV3IFByb2R1Y3RzIiwiaHRpZG9jaWQiOiJqN0tkYmNJc3h4RUFBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFVMXJNbXhzVEhCSGEwMDNjWFZETjFwaFZIaDVNR3RoYldsbVdFOVBTV0Z3VUZwZmIySjZka2RSUjNObldIcEJTREpLVlZsWFZXeE1hV0ZVYWpJdFoyTnlUSEF6UkRWTFQySk9kbHBDYUZKcE5ESjRRMHBmUjBwUVVqSnZaMmR3U21OdE9GZHZhbXBoY0RGSGFXaFRaVjlUV0RONFZFUkRTV1V5Y1RGM05UVXdOVGhKVkdSWWMxVmxTWGR3UnpSUVFUUmlaMnBLTVVWQmFESnNVV1o0TjJ0VmVucEZTMlYwYlRVMFRXTnFZMDlCWm01elIxTkVlSEIzYzBzNGVEUmlSRVJmVTFsbmNGRjRPVVl0Y3pGQ2JqVlVkRE5YYzNsSWIzbHFlSGRRVlY5eFVSSVhhbEJIWDFwS1RIZENkaTFtYTFCSlVIazRlV3QzUVRBYUlrRk1SVk01ZFUxd2FtMUhUM1ZtU3pabmVVcHRSM05QU2xjMWJIcEhRUzFFTWxFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUZWNoOk5ZQyBKb2IgQm9hcmQiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnRlY2hueWMub3JnL2NvbXBhbmllcy9qdXN0d29ya3Mvam9icy8yNjYzNjExOC1mb3VuZGluZy1zdGFmZi1zb2Z0d2FyZS1lbmdpbmVlci1uZXctcHJvZHVjdHM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Senior Manager, Scientific Software Engineer",
        "company_name": "Pfizer",
        "location": "  Pearl River, NY   ",
        "via": "via Glassdoor",
        "description": "Role Summary\n\nWe are seeking an expert scientific software engineer to join Pfizer Digital’s R&D Solutions organization and contribute to streamlining Pfizer’s R&D workflows and enabling data driven decision-making. You will apply your full stack software engineering skills in modern web user interface design and development, analytics pipelines, and database technologies to digitize drug... discovery processes that bring breakthrough medicines to patients.\n\nYou will work closely with Vaccine R&D researchers to align the solutions with the evolving needs of the scientific community while ensuring system usability, robustness, scalability, and maintainability. A good balance of scientific knowledge and solid technical skills will be key to the success of this role.\n\nRole Responsibilities\n• Act as a thought partner in establishing Pfizer’s Digital strategy to support VRD and lead the digital implementation\n• Collaborate with Vaccine R&D scientists to understand their workflows and digital needs, design and implement minimally viable products (MVP) from an initial set of requirements, employ agile methodologies for rapid solution evolution.\n• Manage stakeholder expectations on project scope, deliverables, and timelines.\n• Work in a matrix, team environment with Pfizer colleagues (both Digital and R&D) as well as vendor partners.\n• Mentor junior members in the software development team on best practices in software development.\n• Advocate for Agile and DevOps methodologies and keep abreast of emerging technologies.\n\nBasic Qualifications\n• Bachelor’s degree in computer science, information technology, bioinformatics or related fields, or demonstrable equivalent experience.\n• 10+ years of experience delivering life sciences informatics solutions in the biopharmaceutical realm.\n• Experience with advanced algorithm development and machine learning\n• Programming skills in JavaScript, Java, Python, R, SQL, NoSQL, or other languages.\n• Experience with HPC and cloud platforms such as AWS, GCP and Azure, and familiarity with container technologies such as docker and singularity.\n• Demonstrated ability to act independently, proactively identify problems, troubleshoot issues, and develop potential solutions with innovative approaches.\n• Strong interpersonal, oral and written communication skills. Must contribute to a team-based, collaborative, and positive environment.\n• Candidate demonstrates a breadth of diverse leadership experiences and capabilities including: the ability to influence and collaborate with peers, develop and coach others, oversee and guide the work of other colleagues to achieve meaningful outcomes and create business impact.\n\nPreferred Qualifications\n• Advanced degree (MS, PhD) in computer science, information technology, bioinformatics, or related fields\n• Experience in developing end to end informatics solutions for drug discovery\n• Experience with data visualization tools like Spotfire, Tableau, etc.\n• Experience with data science and analytics tools like Alteryx, Dataiku, etc.\n\nOther Job Details:\n• Last day to apply: August 1, 2023\n• Additional Location Information: La Jolla; California\n\nThe annual base salary for this position ranges from $113,900.00 to $189,700.00. In addition, this position offers an annual bonus with a target of 17.5% of the base salary and eligibility to participate in our share based long term incentive program. Benefits offered include a retirement savings plan, paid vacation, holiday and personal days, paid caregiver/parental and medical leave, and health benefits to include medical, prescription drug, dental and vision coverage in accordance with the terms and conditions of the applicable plans. Pfizer compensation structures and benefit packages are aligned locally, the US Salary range provided does not apply to the Tampa, FL or any EXUS locations.\n\nRelocation assistance may be available based on business needs and/or eligibility.\n\nSunshine Act\n\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\nEEO & Employment Eligibility\n\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n\nInformation & Business Tech\n\n#LI-PFE",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Bachelor’s degree in computer science, information technology, bioinformatics or related fields, or demonstrable equivalent experience",
                    "10+ years of experience delivering life sciences informatics solutions in the biopharmaceutical realm",
                    "Experience with advanced algorithm development and machine learning",
                    "Programming skills in JavaScript, Java, Python, R, SQL, NoSQL, or other languages",
                    "Experience with HPC and cloud platforms such as AWS, GCP and Azure, and familiarity with container technologies such as docker and singularity",
                    "Demonstrated ability to act independently, proactively identify problems, troubleshoot issues, and develop potential solutions with innovative approaches",
                    "Strong interpersonal, oral and written communication skills",
                    "Must contribute to a team-based, collaborative, and positive environment",
                    "Candidate demonstrates a breadth of diverse leadership experiences and capabilities including: the ability to influence and collaborate with peers, develop and coach others, oversee and guide the work of other colleagues to achieve meaningful outcomes and create business impact"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "You will apply your full stack software engineering skills in modern web user interface design and development, analytics pipelines, and database technologies to digitize drug discovery processes that bring breakthrough medicines to patients",
                    "You will work closely with Vaccine R&D researchers to align the solutions with the evolving needs of the scientific community while ensuring system usability, robustness, scalability, and maintainability",
                    "A good balance of scientific knowledge and solid technical skills will be key to the success of this role",
                    "Act as a thought partner in establishing Pfizer’s Digital strategy to support VRD and lead the digital implementation",
                    "Collaborate with Vaccine R&D scientists to understand their workflows and digital needs, design and implement minimally viable products (MVP) from an initial set of requirements, employ agile methodologies for rapid solution evolution",
                    "Manage stakeholder expectations on project scope, deliverables, and timelines",
                    "Work in a matrix, team environment with Pfizer colleagues (both Digital and R&D) as well as vendor partners",
                    "Mentor junior members in the software development team on best practices in software development",
                    "Advocate for Agile and DevOps methodologies and keep abreast of emerging technologies"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "The annual base salary for this position ranges from $113,900.00 to $189,700.00",
                    "In addition, this position offers an annual bonus with a target of 17.5% of the base salary and eligibility to participate in our share based long term incentive program",
                    "Benefits offered include a retirement savings plan, paid vacation, holiday and personal days, paid caregiver/parental and medical leave, and health benefits to include medical, prescription drug, dental and vision coverage in accordance with the terms and conditions of the applicable plans",
                    "Pfizer compensation structures and benefit packages are aligned locally, the US Salary range provided does not apply to the Tampa, FL or any EXUS locations"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.pfizer.com/",
                "text": "pfizer.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Pfizer&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCKYL",
                "text": "See web results for Pfizer"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQM47qW0GsIoC8Ah9EdLFhSL0lIDakHo08N96WT_0w&s",
        "extensions": [
            "28 days ago",
            "114K–190K a year",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "28 days ago",
            "schedule_type": "Full-time",
            "salary": "114K–190K a year"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFuYWdlciwgU2NpZW50aWZpYyBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiN3Vqc2xzQWpZQ2NBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTFyTW14c1RFWjRUVjlSTVVWTWQxUnBibFZTT0hSeWJHSldMVXBpVTBKa2FXUjJMV2RZTVY5UVNHaGtTM2hJVWsxYVFqRlVUR2RpY0ROd2QwbHRUbUptVm10Q05HRk1WMUpKZG14ek5rSkJUbVl6Y1RrME1YcFBWbkZQWWxaMFNVTnBVVkp5WW1sZlpuSkdTWE5UZVdsMlZGbzBXbTlWU2toTFkxWmFWbEZzYWxOMFgza3RaMEp6VVdwQ1FsTk5SbXR1VmpKNFVUVkJTRUUwY1V0S2RXNVljV3BFZDB0R01VMXliVTlCVFZodFprUnVUbWRxWmtKT2NsRkVibmxaTUVrNE1WbHVZemhsYTNaeVJYSkpWVkZQYm1Fd1QzaEdSRWhpZWpWdkxWbEpVUklYYWxCSFgxcEtUSGRDZGkxbWExQkpVSGs0ZVd0M1FUQWFJa0ZNUlZNNWRVMUxkR1ZpU0hoU01FOTFjV0Z0VTBSNFRVWmtVMUZ4VVRCNWNIYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5jb20vam9iLWxpc3Rpbmcvc2VuaW9yLW1hbmFnZXItc2NpZW50aWZpYy1zb2Z0d2FyZS1lbmdpbmVlci1wZml6ZXItSlZfSUMxMTMyMzY3X0tPMCw0M19LRTQ0LDUwLmh0bT9qbD0xMDA4NzI3NTc1MDk0XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "New Grad 2023 | Product Designer",
        "company_name": "Ramp",
        "location": "  New York, NY   ",
        "via": "via EFinancialCareers",
        "description": "About Ramp\n\nRamp is building the next generation of finance tools-from corporate cards and expense management, to bill payments and accounting integrations-designed to save businesses time and money with every click. Over 12,000 customers cut their expenses by 3.5% per year and close their books 8x faster by switching to the Ramp platform...\n\nFounded in 2019, Ramp powers the fastest-growing corporate card and bill payment software in America and enables billions of dollars of purchases each year. Ramp continues to grow quickly, more than doubling its revenue run rate in the first half of 2022.\n\nValued at $8.1 billion, Ramp's investors include Founders Fund, Stripe, Citi, Goldman Sachs, Coatue Management, D1 Capital Partners, Redpoint Ventures, General Catalyst, and Thrive Capital, as well as over 100 angel investors who were founders or executives of leading companies. The Ramp team comprises talented leaders from leading financial services and fintech companies-Stripe, Affirm, Goldman Sachs, American Express, Mastercard, Visa, Capital One-as well as technology companies such as Meta, Uber, Netflix, Twitter, Dropbox, and Instacart. Ramp was named Fast Company's #1 Most Innovative Company in North America in 2023 and #5 on LinkedIn Top Startups 2022.\n\nAbout the Role\n\nWe seek a Product Designer motivated by the opportunity to learn from an exceptional team and deliver delightful experiences for our customers-a ground floor opportunity in a design-driven company. Join a hyper-collaborative design team and get autonomy, ownership, and significant impact across the entire product. You will evolve our design process, own entire projects, and contribute to the development of a diverse team that champions our users' voices and ships incredible experiences every day.\n\nThis is a role for an individual contributor with a genuine desire to learn from the best, champion our users' voices, move fast, own decisions, and ship software every day.\n\nWhat You'll Do\n• Lead design and user experience for significant parts of our core product; contribute to the design process from prioritization through launch\n• Work directly with Principal Designers, Product and Engineering leads to transform company strategy into prioritized initiatives in the roadmap and identify the right problems to solve\n• Be comfortable with breaking down ambiguous problems, ruthlessly prioritizing the highest impact work, and aligning a cross-functional team around it\n• Sweat the details, strive for simplicity, and tie together interconnected projects to make complex tasks approachable\n• Be opinionated and leverage a direct line to our customers to get insights. Explore solutions, create prototypes, and dive into user feedback/data to identify points of friction and opportunities for improvement for every initiative.\n• Advocate for our users by continuously iterating on and evolving our core products and experiences. Identify areas of improvement and deliver value to customers every day\n• Collaborate with the rest of the design team to evolve our long-term product vision, design systems, brand guidelines, and internal design collaboration process\n• Participate in day-to-day team rituals like design crit, story creation, weekly stand-ups, etc\n• Help us hire more amazing people to grow the design team and bring diverse perspectives to our design process\n• Contribute to developing our design internship program, where you will mentor the next generation of product designers What You Need\n• Graduating with a B.S. (or higher) in Design or a related technical field; this role is ideal for a candidate with an expected graduation date in or around May 2023 given the deferred start date in Summer/Fall 2023\n• A portfolio of product design samples, either from personal projects or past internships\n• Demonstrated experience with end-to-end (hybrid UX and UI) product design\n• Experience working with developers and PMs building and shipping applications or software\n• Extraordinary visual design skills and strong understanding of UX principles\n• Background in visual/interaction design, UX/UI, branding & identity, and typography\n• Experience with low and high-fidelity prototyping\n• Excellent communication and collaboration skills Nice-to-Haves\n• A strong understanding of software engineering workflows and principles is encouraged Compensation\n• The annual salary/OTE range for the target level for this role is $106,250-$125,000 + target equity + benefits (including medical, dental, vision, and 401(k) Ramp Benefits (for U.S. based employees)\n• 100% medical, dental & vision insurance coverage for you\n• Partially covered for your dependents\n• One Medical annual membership\n• 401k (including employer match)\n• Please note only 401k contributions made while employed by Ramp are eligible for an employer match\n• Unlimited PTO\n• Fertility HRA (up to $5,000 per year)\n• WFH stipend to support your home office needs\n• Wellness stipend\n• Parental Leave\n• Relocation support\n• Pet insurance",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Graduating with a B.S. (or higher) in Design or a related technical field; this role is ideal for a candidate with an expected graduation date in or around May 2023 given the deferred start date in Summer/Fall 2023",
                    "A portfolio of product design samples, either from personal projects or past internships",
                    "Demonstrated experience with end-to-end (hybrid UX and UI) product design",
                    "Experience working with developers and PMs building and shipping applications or software",
                    "Extraordinary visual design skills and strong understanding of UX principles",
                    "Background in visual/interaction design, UX/UI, branding & identity, and typography",
                    "Experience with low and high-fidelity prototyping",
                    "Excellent communication and collaboration skills Nice-to-Haves",
                    "A strong understanding of software engineering workflows and principles is encouraged Compensation"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "You will evolve our design process, own entire projects, and contribute to the development of a diverse team that champions our users' voices and ships incredible experiences every day",
                    "Lead design and user experience for significant parts of our core product; contribute to the design process from prioritization through launch",
                    "Work directly with Principal Designers, Product and Engineering leads to transform company strategy into prioritized initiatives in the roadmap and identify the right problems to solve",
                    "Be comfortable with breaking down ambiguous problems, ruthlessly prioritizing the highest impact work, and aligning a cross-functional team around it",
                    "Sweat the details, strive for simplicity, and tie together interconnected projects to make complex tasks approachable",
                    "Be opinionated and leverage a direct line to our customers to get insights",
                    "Explore solutions, create prototypes, and dive into user feedback/data to identify points of friction and opportunities for improvement for every initiative",
                    "Advocate for our users by continuously iterating on and evolving our core products and experiences",
                    "Identify areas of improvement and deliver value to customers every day",
                    "Collaborate with the rest of the design team to evolve our long-term product vision, design systems, brand guidelines, and internal design collaboration process",
                    "Participate in day-to-day team rituals like design crit, story creation, weekly stand-ups, etc",
                    "Help us hire more amazing people to grow the design team and bring diverse perspectives to our design process",
                    "Contribute to developing our design internship program, where you will mentor the next generation of product designers What You Need"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "The annual salary/OTE range for the target level for this role is $106,250-$125,000 + target equity + benefits (including medical, dental, vision, and 401(k) Ramp Benefits (for U.S. based employees)",
                    "100% medical, dental & vision insurance coverage for you",
                    "Partially covered for your dependents",
                    "One Medical annual membership",
                    "401k (including employer match)",
                    "Please note only 401k contributions made while employed by Ramp are eligible for an employer match",
                    "Unlimited PTO",
                    "Fertility HRA (up to $5,000 per year)",
                    "WFH stipend to support your home office needs",
                    "Wellness stipend",
                    "Parental Leave"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&q=Ramp&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCPML",
                "text": "See web results for Ramp"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSeeCJQJ-dXuE_hZrPfHJrWmWA9bZRZXyld0seBLXU&s",
        "extensions": [
            "7 days ago",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "7 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJOZXcgR3JhZCAyMDIzIHwgUHJvZHVjdCBEZXNpZ25lciIsImh0aWRvY2lkIjoiRXRZVnZ5LTYtYlVBQUFBQUFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTFyTW14c1N6TjNZMmwxZGxSNVIwRTBaMjB3VmpkSmJFZHdXV3BDUmtWak5YaFhkak01TlRoQmJVOW1Ralo0VmxweU1WZEVkMVp1WWpaQ1YwRTNhRUpQVEVKSllWSllaakZLVnpod09IbEdRMFprZWxkM2FsRjRNblV3UVRkTVUwUkJTSEZJUWpoUE1XZEJiRVpxZG5CbmMyMHlTblJSV1hwdkxXZHJSMUEyTmtJNWFXSTBiR1ZTV0ZwbVNqVk9RV0pDTlRGSk9GVm1iVWxuVHpOelNreGxSVUpOYkRZeGVuQldTaTFOVlZGalRGbERVVTgwRWhkcVVFZGZXa3BNZDBKMkxXWnJVRWxRZVRoNWEzZEJNQm9pUVV4RlV6bDFVRzk1WTNsbWNWSkpNbmR1UjNKSlFsTmhiMFZOUkdGaGRFbDZadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuY29tL2pvYnMtVVNBLU5ZLU5ld19Zb3JrLU5ld19HcmFkXzIwMjNfX1Byb2R1Y3RfRGVzaWduZXIuaWQyMDAwNTU1OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineer II Remote",
        "company_name": "Patterson",
        "location": "  New York, NY   ",
        "via": "via Jobilize",
        "description": "Patterson isn't just a place to work, it's a partner that cares about your success.\n\nOne of the distinguishing marks of our company is the talented people who embrace the people-first, always advancing, and results-driven culture. Professional growth abounds in this motivating environment. We value the diverse talents and experiences our employees bring to Patterson and believe that they build a... stronger and successful organization.\n\nJob Summary\n\nThe Software Engineer defines, develops, tests, analyzes, and maintains software applications. This includes being involved in understanding the business impact of the necessary work and creating solutions to realize that impact by researching, designing, documenting, and modifying software specifications throughout the development life cycle. The Software Engineer works as part of a team on a moderately complex product, project or technical domain.\n\nEssential Functions\n\nTo perform this job successfully, an employee must be able to perform each essential function satisfactorily, with or without reasonable accommodation. To request a reasonable accommodation, notify Human Resources or the manager who oversees the position.\n• Collaborate with customers, stakeholders, developers, and other team members in the conceptualization and development of new or existing software applications.\n• Assist in the definition, development, and documentation of softwares objectives, deliverables, and specifications in collaboration with internal users and departments.\n• Help research, identify, analyze, and fulfill requirements of all internal and external users and stakeholders.\n• Create software to enhance functionality and performance of company applications\n• Execute software testing on new and existing programs for the purposes of correcting errors and general debugging.\n• Operate and monitor software in production for performance, maintenance needs, and ongoing success.\n• Participate in defining software development plans, including scoping, scheduling, and implementation.\n• Deploy software through environments to production upon completion of development, testing, and documentation.\n• Conduct code reviews based on teams defined best practices\n• Provide product and software support for bugs, issues, and escalated incident tickets from end users to resolve application and software issues.\n• Partner with others in resolving problems with software products or company software systems.\n• Responsible for software aspects of your team or technical domain, potentially as a subject matter expert or owner of a service or functionality.\n• Recommends new technologies, approaches, and best practices for their team.\n\nAdditional functions\n\nIn addition to the essential functions listed above, the incumbent may perform the following additional functions.\n\nParticipate in regulatory and compliance activities.\n\nJob Qualifications\n\nRequired Qualifications\n\nBachelor's in Computer Science, Information Systems, a related field, or equivalent work experience\n\nAt least 3 years of software development experience required, leveraging various modern language, frameworks, or platforms.\n\nKnowledge of all aspects of application development and product life cycles, including agile approaches\n\nExcellent understanding of software development and engineering best practices\n\nExtensive database and operating systems experience\n\nDemonstrated knowledge in object-oriented programming and design\n\nAbility to conduct research into software-related issues and products\n\nPreferred Qualifications\n• Knowledge of programming for different delivery approaches such as on-premises, web, cloud, and mobile\n\nTravel to customer, vendor and corporate sites is periodically required\n\nOn call rotations and available outside of normal business hours on evenings and weekends during critical production release or issue escalation periods\n\nWhat's In It For You:\n\nWe provide competitive benefits, unique incentive programs and rewards for our eligible employees:\n• Full Medical, Dental, and Vision benefits and an integrated Wellness Program.\n• 401(k) Match Retirement Savings Plan.\n• Employee Stock Purchase Plan (ESPP).\n• Paid Time Off (PTO).\n• Holiday Pay & Floating Holidays.\n• Volunteer Time Off (VTO).\n• Educational Assistance Program (Tuition Reimbursement).\n• Full Paid Parental and Adoption Leave.\n• LifeWorks (Employee Assistance Program).\n• Patterson Perks Program.\n\nEEO Statement\n\nEOE, including disability/vets.\nWe are Patterson. We welcome you.\n\nAssociated topics: .net, application, developer, devops, java, matlab, perl, sde, software development engineer, sw",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Bachelor's in Computer Science, Information Systems, a related field, or equivalent work experience",
                    "At least 3 years of software development experience required, leveraging various modern language, frameworks, or platforms",
                    "Knowledge of all aspects of application development and product life cycles, including agile approaches",
                    "Excellent understanding of software development and engineering best practices",
                    "Extensive database and operating systems experience",
                    "Demonstrated knowledge in object-oriented programming and design",
                    "Ability to conduct research into software-related issues and products"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "The Software Engineer defines, develops, tests, analyzes, and maintains software applications",
                    "This includes being involved in understanding the business impact of the necessary work and creating solutions to realize that impact by researching, designing, documenting, and modifying software specifications throughout the development life cycle",
                    "The Software Engineer works as part of a team on a moderately complex product, project or technical domain",
                    "To perform this job successfully, an employee must be able to perform each essential function satisfactorily, with or without reasonable accommodation",
                    "To request a reasonable accommodation, notify Human Resources or the manager who oversees the position",
                    "Collaborate with customers, stakeholders, developers, and other team members in the conceptualization and development of new or existing software applications",
                    "Assist in the definition, development, and documentation of softwares objectives, deliverables, and specifications in collaboration with internal users and departments",
                    "Help research, identify, analyze, and fulfill requirements of all internal and external users and stakeholders",
                    "Create software to enhance functionality and performance of company applications",
                    "Execute software testing on new and existing programs for the purposes of correcting errors and general debugging",
                    "Operate and monitor software in production for performance, maintenance needs, and ongoing success",
                    "Participate in defining software development plans, including scoping, scheduling, and implementation",
                    "Deploy software through environments to production upon completion of development, testing, and documentation",
                    "Conduct code reviews based on teams defined best practices",
                    "Provide product and software support for bugs, issues, and escalated incident tickets from end users to resolve application and software issues",
                    "Partner with others in resolving problems with software products or company software systems",
                    "Responsible for software aspects of your team or technical domain, potentially as a subject matter expert or owner of a service or functionality",
                    "Recommends new technologies, approaches, and best practices for their team",
                    "Participate in regulatory and compliance activities",
                    "Travel to customer, vendor and corporate sites is periodically required",
                    "On call rotations and available outside of normal business hours on evenings and weekends during critical production release or issue escalation periods"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "We provide competitive benefits, unique incentive programs and rewards for our eligible employees:",
                    "Full Medical, Dental, and Vision benefits and an integrated Wellness Program",
                    "401(k) Match Retirement Savings Plan",
                    "Employee Stock Purchase Plan (ESPP)",
                    "Paid Time Off (PTO)",
                    "Holiday Pay & Floating Holidays",
                    "Volunteer Time Off (VTO)",
                    "Educational Assistance Program (Tuition Reimbursement)",
                    "Full Paid Parental and Adoption Leave",
                    "LifeWorks (Employee Assistance Program)",
                    "Patterson Perks Program"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&q=Patterson&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCL8M",
                "text": "See web results for Patterson"
            }
        ],
        "extensions": [
            "6 days ago",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "6 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBJSSBSZW1vdGUiLCJodGlkb2NpZCI6IkhtR08tWlZoVzZnQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVUxck1teHNTM3BQWlhseE1uaHJVREIyTjJKbmVXcDBhazl6WjJabFptcGtOMUZKWWswelIyZGpRV0YyY0hsclEwVlhaMGsxZGxWdVVucE5hRkZHTkdoZmRWQllkMHRXUW5WRlYxWmxhME5GVm5sNlpWaEdVRFZGTURadWFIWXdhRkJaYzJsaFRGQk1PRE4zV0Y5WlZVdGpRakl6UzFVNFlrdEpOVUZLVGs5c00xazBPV0Y0Wm5Ga2Jua3dkazVaTmpGaU56aHVPRTB5YjJKblRsOU9Xa015TkVselFqWTViWFJOUVRSSVowcG1hWEYyYWs1akVoZHFVRWRmV2twTWQwSjJMV1pyVUVsUWVUaDVhM2RCTUJvaVFVeEZVemwxVG1oaGJYVmpkV3RCVGxWb2FGbEhkWFpqWlZZeGVHUmxiM294ZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY185IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmlsaXplIiwibGluayI6Imh0dHBzOi8vd3d3LmpvYmlsaXplLmNvbS9qb2IvdXMtbnktbmV3LXlvcmstc29mdHdhcmUtZW5naW5lZXItaWktcmVtb3RlLXBhdHRlcnNvbi1oaXJpbmctbm93LWpvYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Developer",
        "company_name": "Breezeline",
        "location": "  Quincy, MA   ",
        "via": "via LinkedIn",
        "description": "Our culture lifts you up—there is no ego in the way. Our common purpose? We all want to win for our customers. We aim to always be evolving, dynamic, and ambitious. We believe in the power of genuine connections. Each employee is a part of what makes us unique on the market: agile and dedicated.\n\nTime Type...\n\nRegular\n\nJob Description\n\nAbout Our Company\n\nBreezeline is a dynamic, innovative company providing the very best Internet, TV, and Voice service to the US markets we serve. We are ‘Above And Beyonders’, who consistently strive to surprise and delight our customers by doing the unexpected. We continually look for new and better ways to enrich our customers’ lives through connected and memorable experiences.\n\nAs the eighth-largest cable operator in the United States, Breezeline reaches more than 1.7 million homes and businesses in 13 states with Internet, TV, Voice and fiber services. Headquartered in Quincy, MA, Breezeline is a subsidiary of Cogeco Communications Inc. (TSX:CCA).\n\nWhy Work At Breezeline?\n\nAs one of the country’s fast-growing Internet service providers, Breezeline offers our colleagues a vibrant workplace culture and excellent career opportunities. As a proudly diverse and inclusive organization, we believe that every person’s unique individuality should be welcomed and celebrated, and their abilities and potential should be honored and recognized. It is a key part of our culture to actively promote opportunities internally to ensure that you are never static in your career with us.\n\nInternal Values – How we act\n\nWe’re proud that Breezeline is unlike any other employer in the industry. We work hard, but we never lose sight of the big picture. We understand that our colleagues are looking for more than just a great job – they want an extraordinary life – and at Breezeline, we want to make that a reality.\n\nAnd here is how we do it.\n\nFun: We laugh a lot. It makes every day brighter, and if you don’t love what you do, you’re not doing it right.\n\nJob flexibility: We think everything you do matters – at work and home.\n\nDiscounted services: We offer our customers some fantastic services, and we think you deserve to enjoy them in your home, too.\n\nTotal Rewards: Let’s be honest, everyone wants to make a good salary. We offer attractive total rewards and a great culture to go along with it. We’ve got you and your family covered with one of the best packages in the business.\n\nCareer evolution: At Breezeline, you get more than just a job. You get all the tools you need to learn, grow, and achieve your career goals!\n\nCutting-edge technology: Do you have a passion for technology? Great, we do, too. At Breezeline, you will get the opportunity to manage, influence, play, create, fix, and re-shape the industry.\n\nJob Summary\n\nAs a Software Developer, you’re a member of our DevOps team that aids in the innovation and creation of tools, APIs, and applications that support and interconnect Breezeline’s products and services to its customers and employees alike.\n\nWhat will you do?\n• Build and maintain Elixir apps using Phoenix and Absinthe.\n• Develop and maintain dockerized apps for deployment to Google Cloud or in our data centers.\n• Expand our testing coverage for existing applications and packages.\n• Migrate legacy applications from PHP, Perl, Python to Elixir.\n• Contribute to and maintain Open Source Elixir packages.\n• Mentor junior developers on software development best practices.\n• Participate in system design and code reviews.\n\nIdeally You Have\n• 2-4 years of software development and deployment experience.\n• Elixir production experience with Phoenix, GraphQL, REST APIs.\n• Alternatively, prior experience with Ruby on Rails, or any functional language.\n• Experience collaborating with tools such as Git, BitBucket, and Jira.\n• Significant experience with Linux OS environments.\n• Experience working in Google Cloud Platform is a plus.\n• Experience working with front-ends written with react.js using GraphQL.\n• Container-based development and deployment experience, such as docker, swarm, Kubernetes.\n• Familiarity with authentication mechanisms such as LDAP and OpenID, SSO.\n• Keycloak IAM experience is appreciated but not required\n• Strong SQL and database experience, PostgreSQL or MySQL/MariaDB preferred.\n\nIf you don’t meet 100% of the above qualifications but are eager to learn them, we want you to apply.\n\nThis remote position is open to any qualified candidate who resides within the Breezeline footprint:\n• Connecticut\n• Delaware\n• Florida\n• Maine\n• Maryland\n• Massachusetts\n• New Hampshire\n• Ohio\n• Pennsylvania\n• South Carolina\n• Virginia\n• West Virginia\n\nBenefits\n• Competitive salary\n• Medical coverage (including prescription and vision plans)\n• Dental coverage\n• Life Insurance (1x salary at no cost to employee)\n• Long and short-term disability insurance (no cost to employee)\n• Voluntary employee, spousal, and child life insurance\n• Company recognized Holidays with additional Floating Holidays\n• Paid Time Off (PTO) programs\n• Comprehensive Flex Work Policy\n• 401(k) plan eligibility (company match 50% up to 5% of eligible contributions)\n• Participation in the Employee Bonus Plan\n• Participation in the Cogeco Stock Purchase Plan\n• Complimentary and discounted broadband services (for those in our service area)\n• Tuition Reimbursement\n• Headspace Membership\n• Betterhelp Membership\n• Opportunities for LinkedIn Learning subscriptions for select colleagues\n\nLocation :\n\nRochester, NH\n\nCompany\n\nBreezeline\n\nAt Cogeco, we know that different backgrounds, perspectives, and beliefs can bring critical value to our business. The strength of this diversity enhances our ability to imagine, innovate, and grow as a company. So, we are committed to doing everything in our power to create a more diverse and inclusive world of belonging.\n\nBy creating a culture where all our colleagues can bring their best selves to work, we’re doing our part to build a more equitable workplace and world. From professional development to personal safety, Cogeco constantly strives to create an environment that welcomes and nurtures all. We make the health and well-being of our colleagues one of our highest priorities, for we know engaged and appreciated employees equate to a better overall experience for our customers.\n\nIf you need any accommodations to apply or as part of the recruitment process, please contact us confidentially at inclusion@cogeco.com",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "2-4 years of software development and deployment experience",
                    "Elixir production experience with Phoenix, GraphQL, REST APIs",
                    "Alternatively, prior experience with Ruby on Rails, or any functional language",
                    "Experience collaborating with tools such as Git, BitBucket, and Jira",
                    "Significant experience with Linux OS environments",
                    "Experience working with front-ends written with react.js using GraphQL",
                    "Container-based development and deployment experience, such as docker, swarm, Kubernetes",
                    "Familiarity with authentication mechanisms such as LDAP and OpenID, SSO",
                    "Keycloak IAM experience is appreciated but not required"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Build and maintain Elixir apps using Phoenix and Absinthe",
                    "Develop and maintain dockerized apps for deployment to Google Cloud or in our data centers",
                    "Expand our testing coverage for existing applications and packages",
                    "Migrate legacy applications from PHP, Perl, Python to Elixir",
                    "Contribute to and maintain Open Source Elixir packages",
                    "Mentor junior developers on software development best practices",
                    "Participate in system design and code reviews"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Discounted services: We offer our customers some fantastic services, and we think you deserve to enjoy them in your home, too",
                    "Total Rewards: Let’s be honest, everyone wants to make a good salary",
                    "We offer attractive total rewards and a great culture to go along with it",
                    "We’ve got you and your family covered with one of the best packages in the business",
                    "Career evolution: At Breezeline, you get more than just a job",
                    "Competitive salary",
                    "Medical coverage (including prescription and vision plans)",
                    "Dental coverage",
                    "Life Insurance (1x salary at no cost to employee)",
                    "Long and short-term disability insurance (no cost to employee)",
                    "Voluntary employee, spousal, and child life insurance",
                    "Company recognized Holidays with additional Floating Holidays",
                    "Paid Time Off (PTO) programs",
                    "Comprehensive Flex Work Policy",
                    "401(k) plan eligibility (company match 50% up to 5% of eligible contributions)",
                    "Participation in the Employee Bonus Plan",
                    "Participation in the Cogeco Stock Purchase Plan",
                    "Complimentary and discounted broadband services (for those in our service area)",
                    "Tuition Reimbursement",
                    "Headspace Membership",
                    "Betterhelp Membership",
                    "Opportunities for LinkedIn Learning subscriptions for select colleagues"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.atlanticbb.com/",
                "text": "atlanticbb.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Breezeline&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCI0N",
                "text": "See web results for Breezeline"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSHNBYQI01_92hZvTgXoxwgCUF-1snFFNfod4Qx33Q&s",
        "extensions": [
            "18 hours ago",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "18 hours ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJodGlkb2NpZCI6ImVYOFlGOGxtdHZNQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVUxck1teHNURU40VDJOZmJXOVlZemcwTVVWNlgwSkVkak5HTTNWNU1VeHVNbVpwYWs1TlVIbHZUMEl5T0hsRmVHbHZPRTVZZDI4NGRUTTNkVTVRT0ZSbVpXbzJkMngxVFhZNU5FdDZRMFkxYlVoVE5UZHNjWFJRTmtaRFFrTk1MVnAwZUc5TVlVSnJNWEV6UW1Nd2FUbE1hVmRwVkRaQ1dVZ3dOSEl6WDJGNVRsSXdNakpXUkRCU1duVjZiamx6UWpONU5sRnZVWGhuY2w5dFYwa3dUMGhaZDBwaVpXSjVka2h5YXpOMU1qUjRNM1ZoU1ZKSkVoZHFVRWRmV2twTWQwSjJMV1pyVUVsUWVUaDVhM2RCTUJvaVFVeEZVemwxVDJzeldISTRablJ2YW5aV1h6RnhUemxLVkVWUlJtSlhRV2R1VVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3d3dy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvZnR3YXJlLWRldmVsb3Blci1hdC1icmVlemVsaW5lLTM2NzI1MjMwNTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Space, Intelligence & Weapons Systems Software Engineer (Senior...",
        "company_name": "Boeing",
        "location": "  Tysons, VA   ",
        "via": "via Snagajob",
        "description": "Job Description\n\nAt Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your... future with us.\n\nThe Boeing Company is currently seeking Software Engineers (Senior/Lead/Expert) to join the Boeing team in a variety of locations.\n\nBoeing Space, Intelligence & Weapons Systems has exciting opportunities for all levels of currently active Top Secret; Top Secret SCI; SSBI; and Tier 5 Software Engineers to join us as part of our teams located in El Segundo, Sylmar, and Seal Beach, CA; Aurora, Colorado Springs, CO; Las Cruces, NM; Kent, WA; Kennedy Space Center (Titusville), FL; Chantilly, Fairfax and Herndon, VA.\n\nAre you ready to build the future of Software with Boeing? Build and strengthen your career in software engineering by helping us create the next generation of embedded software, applications and DevSecOps pipelines.\n\nWe are seeking Software Engineers that are passionate about space and excited to work in a multi-disciplined, collaborative engineering environment that supports the design, development, and implementation of software for existing and emerging Boeing space, intelligence & weapon systems programs.\n\nThese exciting software engineer positions require demonstrated experience in software development projects, a diverse background of project experience, and the clear exhibition of superior judgment and decision making to engineer new solutions and support existing capabilities of multiple software programming projects. Demonstrated critical thinking and troubleshooting skills are required.\n\nOur teams are currently hiring for a broad range of experience levels including Senior, Lead and Expert level Software Engineers.\n\nExamples of possible roles:\n• Flight Software – Develop real time embedded flight software for various vehicle, space, and weapon systems\n• Mission Software – Develop software to accomplish mission objectives for vehicle, space, weapon, and ground control systems\n• Simulators & Test Beds – Develop simulations of vehicles and subsystems\n• DevSecOps - Architect, develop, integrate, and deploy DevSecOps solutions for large software systems\n\nPosition Responsibilities:\n• Develops, documents and maintains architectures, requirements, algorithms, interfaces and designs for software systems\n• Develops and maintains code and integrates software components into a fully functional software system\n• Develops software verification plans, test procedures and test environments, executing the test procedures and documenting test results to ensure software system requirements are met\n• Performs software project management and software supplier management functions\n• Develops, selects, tailors and deploys software processes, tools and metrics.\n• Executes and documents software research and development projects\n• Serves as a subject matter expert for software domains, system-specific issues, processes and regulations\n• Tracks and evaluates software team and supplier performance to ensure product and process conformance to project plans and industry standards\n• Works under general direction\n\nThese positions are expected to be 100% on-site. The selected candidate will be required to work on-site at one of the listed location options.\n\nSome worksites such as Kent, Seal Beach, El Segundo, Kennedy Space Center participate in Boeing’s optional 9/80 schedule rotation. 9/80 is a rotation in which employees can work 9-hour shifts, 8 days per pay period (bi-weekly) and receive every other Friday off.\n\nSecurity Clearance and Export Control Requirements:\n\nThese positions require an active U.S. Top Secret Security Clearance (U.S. Citizenship Required). (A U.S. Security Clearance that has been active in the past 24 months is considered active).\n\nBasic Qualifications:\n• Bachelor’s Degree in engineering, computer science, mathematics, or physics\n• U.S. Top Secret Security Clearance that has been active in the past 24 months and/or a U.S. Top Secret/SCI Security Clearance that has been active in the past 24 months\n\nPreferred Qualifications:\n• 5+ years experience in Electrical Engineering or Electrical/Electronic Systems\n• Level 4 - 5+ years\n• Level 5 & 6 - 10+ years\n• Experience working with space programs and/or aerospace programs\n• Professional communication skills with aptitude or experience creating and presenting technical presentations to various groups of people\n• Proficiency in Microsoft Word, Excel, Outlook, and PowerPoint\n\nTypical Education/Experience:\n\nSenior (Level 4) Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 9 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD+4 years' related work experience, Master+7 years' related work experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nLead (Level 5) Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 14 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD+9 years' related work experience, Master+12 years' related work experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nExpert (Level 6) Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 20 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD+15 years' related work experience, Master+18 years' related work experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard\n\nRelocation:\n\nThis position offers relocation based on candidate eligibility.\n\nDrug Free Workplace:\n\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\n\nShift:\n\nThese positions are for 1st shift.\n\nAbout 5% of positions offered require support for off-shift (or non-first shift) operations during testing and mission operations.\n\nTravel:\n\nSome positions may require travel up to 10% of the time; Domestically and/or Internationally depending on business needs.\n\nNASA Access:\n\nSome positions are located at a site that may require the ability to obtain access to a National Aeronautics and Space Administration (NASA) facility. This position requires the ability to obtain access to a National Aeronautics and Space Administration (NASA) facility. This is a NASA safety-sensitive position and is subject to random drug and alcohol testing.\n\nAt Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities.\n\nThe Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.\n\nThe specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.\n\nPlease note that the salary information shown below is a general guideline only. Salaries are based upon candidate experience and qualifications, as well as market and business considerations.\n\nSummary Pay Range:\n\nSenior (Level 4) $113,900 - $177,100\n\nLead (Level 4) $ 141,100 - $218,500\n\nExpert (Level 6) $161,500 - $250,700\n\nEqual Opportunity Employer:\n\nBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "These exciting software engineer positions require demonstrated experience in software development projects, a diverse background of project experience, and the clear exhibition of superior judgment and decision making to engineer new solutions and support existing capabilities of multiple software programming projects",
                    "Demonstrated critical thinking and troubleshooting skills are required",
                    "These positions require an active U.S. Top Secret Security Clearance (U.S. Citizenship Required)",
                    "Bachelor’s Degree in engineering, computer science, mathematics, or physics",
                    "U.S. Top Secret Security Clearance that has been active in the past 24 months and/or a U.S. Top Secret/SCI Security Clearance that has been active in the past 24 months",
                    "Senior (Level 4) Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 9 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD+4 years' related work experience, Master+7 years' related work experience)"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Flight Software – Develop real time embedded flight software for various vehicle, space, and weapon systems",
                    "Mission Software – Develop software to accomplish mission objectives for vehicle, space, weapon, and ground control systems",
                    "Simulators & Test Beds – Develop simulations of vehicles and subsystems",
                    "DevSecOps - Architect, develop, integrate, and deploy DevSecOps solutions for large software systems",
                    "Develops, documents and maintains architectures, requirements, algorithms, interfaces and designs for software systems",
                    "Develops and maintains code and integrates software components into a fully functional software system",
                    "Develops software verification plans, test procedures and test environments, executing the test procedures and documenting test results to ensure software system requirements are met",
                    "Performs software project management and software supplier management functions",
                    "Develops, selects, tailors and deploys software processes, tools and metrics",
                    "Executes and documents software research and development projects",
                    "Serves as a subject matter expert for software domains, system-specific issues, processes and regulations",
                    "Tracks and evaluates software team and supplier performance to ensure product and process conformance to project plans and industry standards",
                    "Works under general direction"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Elements of the Total Rewards package include competitive base pay and variable compensation opportunities",
                    "The Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work",
                    "The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements",
                    "Senior (Level 4) $113,900 - $177,100",
                    "Lead (Level 4) $ 141,100 - $218,500"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.boeing.com/",
                "text": "boeing.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Boeing&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCNkN",
                "text": "See web results for Boeing"
            }
        ],
        "extensions": [
            "2 days ago",
            "Full-time",
            "Health insurance",
            "Dental insurance"
        ],
        "detected_extensions": {
            "posted_at": "2 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTcGFjZSwgSW50ZWxsaWdlbmNlIFx1MDAyNiBXZWFwb25zIFN5c3RlbXMgU29mdHdhcmUgRW5naW5lZXIgKFNlbmlvciwgTGVhZCwgRXhwZXJ0KSAtIE5vdyBIaXJpbmciLCJodGlkb2NpZCI6Ii1mNWtqM2Jhc2gwQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUNDcUlDUVUxck1teHNTWGwwVVU0NFFqQmlkSFpET0hOM2RGSmtkak15TjFkVlMxOVhiemxhU0VGNGFHMUNObU55WkZKWGEzZGFTSEV0T0ZwR2FFbHpka3B0ZDJoRE1GcE1Za0YwUlU5blNVcFNlRXBJWVVoT1VWOVNjVFExVVZkcVgxOVhTWE5uWWpaM1lucFplRTlzU1VaRVNXZEVVa0o1YkRoa1RVcHFWRWt0TFc1RWVDMTVRV00zWlhkSVZFb3haRWMyUmpoRE4zcDRORGhXUzNoYWJteHhSRlk1ZFZOb2F6UnhUSGQ2U1UxVlltMW1kbUpEWVdkSWQzSjRkbGhxV0RGbFJ6TlRRa2RUYzFsVWQxQmpWbXc0YjI1NVJFTk5aazQ1UkRFNFNHUnpSbFZEZHpWTFJEVmZRMUpZVTNWNExWQjNURUpSU2xCeFJGcHdTVlZXY1Y5WmEzRkhaeTFHWVROek9XUnBXVjg1TkhKeE4yZDRUMlU1U2t4a2NXTk9PVGR3WTBFU0YycFFSMTlhU2t4M1FuWXRabXRRU1ZCNU9IbHJkMEV3R2lKQlRFVlRPWFZRVDJwRFVXdzNjbFpmUlhKaVkzbENaa1I2UTJ0TVEybDZRM0ZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU25hZ2Fqb2IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc25hZ2Fqb2IuY29tL2pvYnMvODU1MTI2OTk5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Test Engineer 3",
        "company_name": "Captivation Software",
        "location": "  Annapolis Junction, MD   ",
        "via": "via Glassdoor",
        "description": "Build Something to Be Proud Of.\n\nCaptivation Software has built a reputation on providing customers exactly what is needed in a timely manner. Our team of engineers take pride in what they develop and constantly innovate to provide the best solution. Captivation Software is looking for mid level test engineer to assist with day to day responsibilities. ...\n\nResponsibilities:\n• Creating testing procedures to evaluate the performance of the software\n• Designing manual and automated test procedures to evaluate each software product\n• Building, coding, and implementing software analytic evaluation test programs and procedures\n• Debug existing software and correct defects. Provide recommendations for improving documentation and software development process standards\n• Run the suite of software analytics and follow the testing procedures to evaluate the software\n• Documenting all testing procedures\n• Reporting bugs and making recommendations to improve the software code and/or functionality.\n• Collaborating with other team members to gather understanding of tasks\n• Retesting analytic code after bugs are fixed to ensure the analytics works properly\n• Attending meetings with the development team, clients and other groups as needed\n• Finalizing and documenting testing procedures.\n• Completing final tests and creating testing suggestions for analytic software fixes\n\nRequirements\n\nSecurity Clearance:\n• Must currently hold a Top Secret / SCI U.S. Government security clearance with a favorable Polygraph, therefore all candidates must be a U.S. citizen\n\nMinimum Qualifications:\n• Eight (8) years experience as a TE in programs and contracts of similar scope, type and complexity is required.\n• Bachelor’s degree in Math, Science, Engineering, Statistics, Engineering Management, or related discipline from an accredited college or university is required.\n• Four (4) years of additional TE experience may be substituted for a bachelor’s degree.\n\nThis position is open for direct hires only. We will not consider candidates from third party staffing/recruiting firms.\n\nBenefits\n• Annual Salary: $125,000 - $250,000 (Depends on the years of experience)\n• Up to 20% 401k contribution (no matching required)\n• Above market hourly rates\n• $3,000 HSA Contribution\n• 5 Weeks Paid Time Off\n• Company Paid Employee Medical / Dental / Vision Insurance / Life Insurance / Short-Term & Long-Term Disability / AD&D",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Must currently hold a Top Secret / SCI U.S. Government security clearance with a favorable Polygraph, therefore all candidates must be a U.S. citizen",
                    "Eight (8) years experience as a TE in programs and contracts of similar scope, type and complexity is required",
                    "Bachelor’s degree in Math, Science, Engineering, Statistics, Engineering Management, or related discipline from an accredited college or university is required",
                    "Four (4) years of additional TE experience may be substituted for a bachelor’s degree"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Creating testing procedures to evaluate the performance of the software",
                    "Designing manual and automated test procedures to evaluate each software product",
                    "Building, coding, and implementing software analytic evaluation test programs and procedures",
                    "Debug existing software and correct defects",
                    "Provide recommendations for improving documentation and software development process standards",
                    "Run the suite of software analytics and follow the testing procedures to evaluate the software",
                    "Documenting all testing procedures",
                    "Reporting bugs and making recommendations to improve the software code and/or functionality",
                    "Collaborating with other team members to gather understanding of tasks",
                    "Retesting analytic code after bugs are fixed to ensure the analytics works properly",
                    "Attending meetings with the development team, clients and other groups as needed",
                    "Finalizing and documenting testing procedures",
                    "Completing final tests and creating testing suggestions for analytic software fixes"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Annual Salary: $125,000 - $250,000 (Depends on the years of experience)",
                    "Up to 20% 401k contribution (no matching required)",
                    "Above market hourly rates",
                    "$3,000 HSA Contribution",
                    "5 Weeks Paid Time Off",
                    "Company Paid Employee Medical / Dental / Vision Insurance / Life Insurance / Short-Term & Long-Term Disability / AD&D"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://captivation.us/",
                "text": "captivation.us"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Captivation+Software&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCKQO",
                "text": "See web results for Captivation Software"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRe0IZNj96O_aYmfZMWNEM42pwJw6natdfbO6FnctM&s",
        "extensions": [
            "2 days ago",
            "125K–250K a year",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "2 days ago",
            "schedule_type": "Full-time",
            "salary": "125K–250K a year"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJUZXN0IEVuZ2luZWVyIDMiLCJodGlkb2NpZCI6IkljTEt5Z2FCLTdFQUFBQUFBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVUxck1teHNTM0ptZEdwSFFtVnVhbFF4ZGtSdVNsWjVhM0F5YkRkdWEwWnRNVkJTVlhKaFJXTm5UVWxuTmpaclpIQmtZM1p5YVU1VlNHRjVaVmRKVEVKaGNFTlphbWwzV0c1TmNIWnVjUzFUV1VNeUxXTnJlakV3YXpaa2JrRnViakZmYjJ3elFUSnlRV2N5TjJOWU1qWlJjSFJDY205aVYwWTJiMEZOT1d4dWVqVjJkMXBxT0VwTFpuSlpUVUZoTTJOSVFUTnZWRmd5VlRGU2VHOTNZM0F4TVhFd2NUbHJiUzFVUjFaTFQzWnBUVEI1VDNVNVRtTXdTRTkyTUZOeWJ6aDRkblYxUlhVNWNGVjNFaGRxVUVkZldrcE1kMEoyTFdaclVFbFFlVGg1YTNkQk1Cb2lRVXhGVXpsMVQyaGZZbEp3UlV4R01FRTNkVlUzTm5abE1GcFhkbkJCWlVGc1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5jb20vam9iLWxpc3RpbmcvdGVzdC1lbmdpbmVlci0zLWNhcHRpdmF0aW9uLXNvZnR3YXJlLUpWX0lDMTE1MzUyNF9LTzAsMTVfS0UxNiwzNi5odG0/amw9MTAwODc3NTA5NTg4Mlx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "SOFTWARE DEVELOPMENT MANAGER",
        "company_name": "Nicolet National Bank",
        "location": "  United States   ",
        "via": "via Jooble",
        "description": "If you are unable to complete this application due to a disability, contact this employer to ask for an accommodation or an alternative application process.\nSOFTWARE DEVELOPMENT MANAGER\n...\nGREEN BAY, WI, US\n\n8 days ago Requisition ID: 2269\n\nAt Nicolet National Bank our role in technology is to enable the business to best serve our three circles; customers, employees, and shareholders. Want to make a tangible impact on the business to turn problems into solutions we can all be proud of? Join the Product and Development team to guide, grow, and prepare Nicolet’s software development practice for cross platform development at scale. Your role as the Development Manager will be to provide mentoring, oversight, governance, and management of the people, development practices, and technical solutions being delivered. A successful individual in this role will be a technical, collaborative leader with broad expertise in automation, integration, and agile software delivery who likes to roll up their sleeves to help a driven team successfully execute on Nicolet’s product roadmap.\n\nAs a Software Development Manager, you will:\n• Hire, coach and develop a team of software developers who are responsible for designing, building, and implementing high quality capabilities with modern technology.\n• Oversee design, testing, and development of software products.\n• Empower teams to consistently write production-ready code that is easily testable and understood by other developers.\n• Build and improve relationships and effectively influence team members in a fast-paced, agile product development atmosphere.\n• Encourage a culture of continuous improvement, cross functional collaboration, and positivity.\n• Implement best practices for software development to help the team effectively manage their code in an efficient, secure, and scalable manner.\n• Understand the team’s testing approach and use quality metrics to identify gaps.\n• Help resolve obstacles and de-motivators across teams to enable efficiency and completion of tasks.\n• Collaborate within the development team to set the direction of the architectural roadmap to meet the needs of the business as defined by Product Ownership.\n• Establish engineering strategic objectives that influence architecture and technical approaches and limit technical debt.\n• Consider scalability, reliability, and performance of systems/contexts affected when defining technical designs.\n• Responsible for application performance, complex APIs and integration across multiple applications.\n• Work closely with others; developers, product owners, and subject matter experts.\n• Other related duties as assigned or requested.\n\nRequired Qualifications :\n• 3 or more years of experience leading a software engineering team.\n• Bachelor’s degree in Computer Science, or equivalent.\n• Candidates must be eligible to work in the United States without limitation.\n• Excellent organizational, verbal and written communication skills.\n• A desire to work within a fast-paced, collaborative, and team-based support environment.\n• Experience implementing best practices for a software development life cycle, and the effective design, estimation, and implementation of solutions.\n• Experience working on complex business system integrations.\n• Experience with object-oriented programming and design patterns.\n• Experience with relational databases and relational data models.\n• Experience with agile methodologies; Scrum, Kanban.\n\nPreferred Qualifications :\n• 5-10 years experience managing a small to medium sized development team (5-15 team members) consisting of several delivery teams using agile methods.\n• Experience working in various Salesforce clouds; Sales, Service, FSC, Experience, Marketing, Data.\n• Experience and expertise in Force.com technology stack including Aura Framework, Lightning Web Components, Apex, SOQL, SOSL, Process Builder, Schema Builder, and Flow.\n• Experience with SOAP and REST web services.\n• Experience with ETL (Extract, Transform, Load) development for data integrations.\n• Expertise in working in a modern Microsoft technology stack.\n• Familiarity with modern cloud architecture using microservices hosted in containers and API centric application design.\n• Past experience in driving testing strategy and experience with automation.\n• Experience architecting and implementing high performing software applications.\n• Strong understanding of CI/CD best practices and tools like BitBucket, Azure DevOps, Copado, etc.\n• Strong people management skills including mentoring and coaching engineers of all skill levels.\n• Strong estimation, resource, and release planning skills amongst multiple streams of work is a strong plus.\n• Financial Services industry experience, particularly with organizations over 10B in assets is a strong plus.\n\nThe above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities and skills required for the position.\n\nEqual Opportunity Employer/Veterans/Disabled",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "3 or more years of experience leading a software engineering team",
                    "Bachelor’s degree in Computer Science, or equivalent",
                    "Candidates must be eligible to work in the United States without limitation",
                    "Excellent organizational, verbal and written communication skills",
                    "A desire to work within a fast-paced, collaborative, and team-based support environment",
                    "Experience implementing best practices for a software development life cycle, and the effective design, estimation, and implementation of solutions",
                    "Experience working on complex business system integrations",
                    "Experience with object-oriented programming and design patterns",
                    "Experience with relational databases and relational data models",
                    "Experience with agile methodologies; Scrum, Kanban"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Join the Product and Development team to guide, grow, and prepare Nicolet’s software development practice for cross platform development at scale",
                    "Your role as the Development Manager will be to provide mentoring, oversight, governance, and management of the people, development practices, and technical solutions being delivered",
                    "A successful individual in this role will be a technical, collaborative leader with broad expertise in automation, integration, and agile software delivery who likes to roll up their sleeves to help a driven team successfully execute on Nicolet’s product roadmap",
                    "Hire, coach and develop a team of software developers who are responsible for designing, building, and implementing high quality capabilities with modern technology",
                    "Oversee design, testing, and development of software products",
                    "Empower teams to consistently write production-ready code that is easily testable and understood by other developers",
                    "Build and improve relationships and effectively influence team members in a fast-paced, agile product development atmosphere",
                    "Encourage a culture of continuous improvement, cross functional collaboration, and positivity",
                    "Implement best practices for software development to help the team effectively manage their code in an efficient, secure, and scalable manner",
                    "Understand the team’s testing approach and use quality metrics to identify gaps",
                    "Help resolve obstacles and de-motivators across teams to enable efficiency and completion of tasks",
                    "Collaborate within the development team to set the direction of the architectural roadmap to meet the needs of the business as defined by Product Ownership",
                    "Establish engineering strategic objectives that influence architecture and technical approaches and limit technical debt",
                    "Consider scalability, reliability, and performance of systems/contexts affected when defining technical designs",
                    "Responsible for application performance, complex APIs and integration across multiple applications",
                    "Work closely with others; developers, product owners, and subject matter experts",
                    "Other related duties as assigned or requested"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.nicoletbank.com/",
                "text": "nicoletbank.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&q=Nicolet+National+Bank&sa=X&ved=0ahUKEwiS5uCbnaqAAxX_D0QIHUsmCdgQmJACCPEO",
                "text": "See web results for Nicolet National Bank"
            }
        ],
        "extensions": [
            "3 days ago",
            "Full-time"
        ],
        "detected_extensions": {
            "posted_at": "3 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTT0ZUV0FSRSBERVZFTE9QTUVOVCBNQU5BR0VSIiwiaHRpZG9jaWQiOiJDeTk5WWlGTl9Gd0FBQUFBQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVMXJNbXhzU2tJMllUTjBkREpXWDJWWGNEZHBUM3B6VjFaUlJGQmFNbWRZVkVJNVJ6RTNRbkphU25KNVEwaFRNbVUyYm5aV1VEQm5UbXAzUzNNNFZ6ZFBRMGRJVEcxZmJsSmFOblpNWTFWR2NUTktaRE5aYkZkZmJtbDNkWE5CTUVScWJVaDZjbkJFZG1OMlZFb3lOSHB5WlVjNVRVMTRhMk5HWTIxMWEySkdZVlV3UzBodldtZGxRa0ZKZFhwdWFXdHpZbkZCZEVaRk1HWXRUakp0ZFV4Rk1rZ3hRWGRQY0VOckxUSk1iREJQVlVaTmJIQkRXazlQTkZOeFFrWlpNRUZ5WlVsTE5GbFFNbGxzRWhkcVVFZGZXa3BNZDBKMkxXWnJVRWxRZVRoNWEzZEJNQm9pUVV4RlV6bDFUMVJUTW5OUlpFZFJjbmxtWkZGbGMzQkNVbmxXY1daYVFqTXhadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvb2JsZSIsImxpbmsiOiJodHRwczovL2pvb2JsZS5vcmcvamRwLy0zMjM5MDU3NDE5OTYwNzY0NTkzL1NPRlRXQVJFLURFVkVMT1BNRU5ULU1BTkFHRVItV2lzY29uc2luP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    }
]